{
	"BartenderNames": {
		"Name_1": "Ted",
		"Name_2": "Barkeep",
		"Name_3": "Jerry",
		"Name_4": "Bill",
		"Name_5": "Ernest",
		"Name_6": "William",
		"Name_7": "Dale",
		"Name_8": "Bruce",
		"Name_9": "Moe",
		"Name_10": "Javahawk",
		"Name_11": "Elandrian",
		"Name_12": "Driscan",
		"Name_13": "Iamisom",
		"Name_14": "Blacksmith",
		"Name_15": "Dani Moo",
		"Name_16": "Paddy"
	},
	"BartenderChatter": {
		"Chatter_1": "I've got the cure for what ails ya! Get it? Ale? No?",
		"Chatter_2": "They say you're strong, well, I know strong. Let's see if you measure up.",
		"Chatter_3": "Back where I'm from, we only serve Root Beer...",
		"Chatter_4": "This is a big upgrade from wiping that table all day.",
		"Chatter_5": "Life's a challenge when you're just naturally better than everyone else.",
		"Chatter_6": "What am I doing here...",
		"Chatter_7": "A lot of tenacity and a little bit of luck can go a long way...",
		"Chatter_8": "Have you seen any Meburs around here?",
		"Chatter_9": "{Dryad} seems nice. I should bring her back with me.",
		"Chatter_10": "Do you think {Steampunker} has an extra of that gun? I know a witch that may want one.",
		"Chatter_11": "No wonder {Demolitionist} has so many accidents. You can't imagine how much ale he buys from me.",
		"Chatter_12": "Normally, I'm not much of a fan of Goblins, but {GoblinTinkerer} seems to be an alright sort.",
		"Chatter_13": "{?Day}Anyone see where the Dryad went?",
		"Chatter_14": "{?!Day}Really quiet out there. A little too quiet...",
		"Chatter_15": "{?!Day}Check in with me, and do your job.",
		"Chatter_16": "{?BloodMoon}You know, where I'm from, a Blood Moon is actually just an excuse to get some fresh air.",
		"Chatter_17": "{?MoonLordDefeated}Moon Lord, don't you mean Abyss Lord?",
		"Chatter_18": "{?HardMode}I know a Lavamancer that would really like that hellstone down in the underworld.",
		"Chatter_19": "{?Homeless}Know any good places to set up shop? Would love to open up a bar here."
	},
	"BartenderSpecialText": {
		"FirstHelp": "For starters, take a few of these Defender Medals, on the house! I've got some special defenses you can purchase, but only with Defender Medals!",	
		"FirstMeeting": "Huh? How did I get here? The last thing I remember was a portal opening up in front of me...",
		"BeforeDD2Tier1": "We should really do something about the Old One's Army. Ask me about the Eternia Crystal if you want to learn more.",
		"AfterDD2Tier1": "Great job on fighting off the Old One's Army! But I'm sure we haven't seen the last of them, they didn't put up much of a fight this time.",
		"AfterDD2Tier2": "The Army of the Old One's keeps getting stronger, yet you keep pushing them back! But something tells me they aren't quite finished with us yet.",
		"AfterDD2Tier3": "You really kept the full force of the Old One's Army at bay? Maybe you should visit Etheria some time."
	},
	"BartenderHelpText": {
		"Help_1": "The first thing you need to know about are the special defensive artifacts I've got for sale, but only if you've got some Defender Medals!",
		"Help_2": "You can use these artifacts to create traps and defensive towers. Doing so consumes Etherian mana, a special energy dropped only by members of the Old One's Army!",	
		"Help_3": "Challenging the Old One's Army is rather simple. They are attracted to the power of the Eternia Crystals, and that can be used to bait them out.",
		"Help_4": "To place an Eternia Crystal, you must obtain an Eternia Crystal and a stand to put it in. It just so happens, you can buy em from me!",
		"Help_5": "You'll want to place your Eternia Crystal stand in a pretty open, flat area. Lots of walls and stuff might make it pretty difficult to protect!",
		"Help_6": "Once your stand is set up, just interact with it while holding an Eternia Crystal, and prepare for a fight!",
		"Help_7": "Of course, you can't let the Old One's Army destroy the Eternia Crystal! This will have catastrophic consequences for my home world of Etheria!",
		"Help_8": "You can place defenses at the cost of 10 Etherian mana. Once placed, the Eternia Crystal will release some of this mana. Otherwise, you will need to defeat enemies to get more.",
		"Help_9": "With the help of the defenses, you will have to repel several waves of invaders who are attempting to destroy both you and the Eternia Crystal!",
		"Help_10": "If you successfully repel the invasion, you'll be awarded with more Defender Medals, which you can bring to me to purchase more artifacts and some other special rewards!",
		"Help_11": "I've also heard rumors that the power of the artifacts themselves may be further unlocked if you defeat the Old One's Army. Perhaps you could even use them any time you wish!"
	},
	"GuideHelpText": {
		"Help_1063": "Normally I'd try to teach you all about the Old One's Army, but you should probably ask {Bartender} about that."
	},
	"GoblinTinkererChatter": {
		"Chatter_1": "You know, these Etherian Goblins are nothing like my people. Really rowdy bunch. Not that my people are much better..."
	},
	"AnglerChatter": {
		"Chatter_1": "How come {Bartender} won't sell me any ale? I want to try some! What a grouch!"
	},
	"DryadSpecialText": {
		"AfterDD2Tier1": "When I was in Etheria, I felt so disconnected from {WorldName}. Its good to be back.",
		"AfterDD2Tier2": "The Corruption tried to take me over when I went to Etheria, but instead, I used its power against the Old One's Army!"
	},
	"WitchDoctorSpecialText": {
		"AfterDD2Tier1": "I sense a kindred spirit in the Etherian Dark Mages. A pity they are our enemies, I would have liked to learn from them."
	},
	"PirateChatter": {
		"Chatter_1": "About time we gotta barkeep around here! Me rum was almost gone!"
	},
	"NurseChatter": {
		"Chatter_1": "I keep asking for wine, but all {Bartender} gives me are mugs of ale."
	},
	"DemolitionistSpecialText": {
		"AfterDD2Start": "I don't see why we can't just blow up those portals."
	},
	"StylistChatter": {
		"Chatter_1": "I offered {Bartender} a free trim, but he refused. I mean, I could have at least worked on his mustache!" 
	},
	"WizardSpecialText": {
		"AfterDD2Tier1": "You know, I think I've seen a portal like that before, but it was gold."
	},
	"PartyGirlSpecialText": {
		"AfterDD2Tier1": "Have you seen an ogre yet? I want to ride on the back of one!"
	},
	"CyborgChatter": {
		"Chatter_1": "{Bartender} said I reminded him of a certain \"EV2\". Perhaps I should meet her."
	},
	"MechanicChatter": {
		"Chatter_1": "{Bartender} offered me a Root Beer, I told him to give it to me in a square cup."
	}
}